src/xmlsamples/autonomous_transfer_complete_1.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:cwmp="urn:dslforum-org:cwmp-1-0">
        <SOAP-ENV:Header>
                <cwmp:ID SOAP-ENV:mustUnderstand="1">1</cwmp:ID>
        </SOAP-ENV:Header>
        <SOAP-ENV:Body>
                <cwmp:AutonomousTransferComplete>
                        <AnnounceURL>http://example.com/announce</AnnounceURL>
                        <TransferURL>http://example.com/transfer</TransferURL>
                        <IsDownload>1</IsDownload>
                        <FileType>1 Firmware Upgrade Image</FileType>
                        <FileSize>10000</FileSize>
                        <TargetFileName>/bin/image</TargetFileName>
                        <FaultStruct>
                                <FaultCode>0</FaultCode>
                                <FaultString></FaultString>
                        </FaultStruct>
                        <StartTime>2016-04-07T08:43:49Z</StartTime>
                        <CompleteTime>2016-04-07T08:45:06Z</CompleteTime>
                </cwmp:AutonomousTransferComplete>
        </SOAP-ENV:Body>
</SOAP-ENV:Envelope>